package hw4;

/**
 *      * <p>
 *      * 2. С помощью JPA(Hibernate) выполнить:
 *      * 2.1 Описать сущность Book из пункта 1.1
 *      * 2.2 Создать Session и сохранить в таблицу 10 книг
 *      * 2.3 Выгрузить список книг какого-то автора
 *      * <p>
 *      * 3.* Создать сущность Автор (id biging, name varchar), и в сущности Book сделать поле типа Author (OneToOne)
 *      * 3.1 * Выгрузить Список книг и убедиться, что поле author заполнено
 *      * 3.2 ** В классе Author создать поле List<Book>, которое описывает список всех книг этого автора. (OneToMany)
 */
public class Homework_2 {
}
